tutorials/cfdemSolverRhoPimple/FinesColumn/CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          192;
        startFace       29488;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          192;
        startFace       29680;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1696;
        startFace       29872;
    }
)

// ************************************************************************* //
