tutorials/cfdemSolverRhoPimple/FinesColumn/CFD/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          couplingProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//===========================================================================//
// sub-models & settings

modelType "A"; // A or B

couplingInterval 10;

voidFractionModel divided;

locateModel engine;//turboEngineM2M;//

meshMotionModel noMeshMotion;

regionModel allRegion;

IOModel "basicIO";

dataExchangeModel twoWayMPI;//twoWayM2M;//twoWayFiles;//oneWayVTK;//

averagingModel dense;//dilute;//

clockModel standardClock;//off;

smoothingModel constDiffSmoothing;

probeModel off;

forceModels
(
    dSauter
    Fines
    FanningDynFines
    ErgunStatFines
    gradPForce
    viscForce
);

momCoupleModels
(
    implicitCouple
    explicitCouple
);

otherForceModels
(
    gravity
    weightSecondaryPhase
    expParticleForces
);

energyModels
(
    heatTransferGunn
);

thermCondModel SyamlalThermCond;

chemistryModel off;

turbulenceModelType "turbulenceProperties";

//===========================================================================//
// sub-model properties

implicitCoupleProps
{
    velFieldName "U";
    granVelFieldName "Us";
    voidfractionFieldName "voidfraction";
}

explicitCoupleProps
{
    fLimit (1e3 1e3 1e3);
}

dSauterProps
{

}
gradPForceProps
{
    pFieldName "p";
    densityFieldName "rho";
    voidfractionFieldName "voidfraction";
    velocityFieldName "U";
}

GidaspowDragProps
{
    verbose false;
    velFieldName "U";
    granVelFieldName "Us";
    voidfractionFieldName "voidfraction";
    interpolation true;
    phi 1;
}

heatTransferGunnProps
{
    partTempName "Temp";
    partHeatFluxName "convectiveHeatFlux";
    calcPartTempField false;
    partRefTemp 293;
    interpolation false;
}

viscForceProps
{
    velocityFieldName "U";
    densityFieldName "rho";
    interpolation;
}

ErgunStatFinesProps
{
    velFieldName "U";
    granVelFieldName "Us";
    densityFieldName "rho";
    voidfractionFieldName "voidfraction";
    phi 1;
}

FanningDynFinesProps
{
    velFieldName "U";
    granVelFieldName "Us";
    densityFieldName "rho";
    voidfractionFieldName "voidfraction";
}

FinesFieldsProps
{
    velFieldName "U";
    granVelFieldName "Us";
    densityFieldName "rho";
    voidfractionFieldName "voidfraction";
    dFine 0.000388;
    rhoFine 1369;
    alphaMax 0.95;
    critVoidfraction 0.05;
    depRate 0.05;
    nCrit 2.25;
    poresizeWidth 0.2;
    verbose true;
    diffCoeff 0.005;
}

gravityProps
{
}

weightSecondaryPhaseProps
{
    volfracFieldName "alphaDyn";
    rho 1369;
}

SyamlalThermCondProps
{
}

centreProps
{
    alphaMin 0.10;
}

engineProps
{
    treeSearch true;
}

turboEngineM2MProps
{
    turboEngineProps
    {
        treeSearch true;
    }
}

dividedProps
{
    alphaMin 0.25;
    scaleUpVol 1.0;
    weight 1.0; //1.33;
    verbose;
}

constDiffSmoothingProps
{
    verbose;
    lowerLimit 0.25;
    upperLimit 1.0;
    smoothingLength 0.005;
}

oneWayVTKProps
{
    couplingFilename "vtk_out%4.4d.vtk";
    maxNumberOfParticles 50000;
}

twoWayFilesProps
{
    maxNumberOfParticles 50000;
}

twoWayMPIProps
{
    maxNumberOfParticles 50000;
    liggghtsPath "../DEM/in.liggghts_resume";
}

twoWayM2MProps
{
    maxNumberOfParticles 50000;
    liggghtsPath "../DEM/in.liggghts_resume";
 }

particleProbeProps
{
        particleIDsToSample "0";
}
// ************************************************************************* //
