tutorials/cfdemSolverRhoPimple/FinesColumn/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type            uniformFixedValue;
        uniformValue    constant (0 0 0);
    }

    inlet
    {
        type               interstitialInletVelocity;
        inletVelocity      uniform (0 0 1.24);//0.88);
        alpha              voidfraction;
        value              $internalField;
    }
    

    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
