tutorials/cfdemSolverRhoPimple/FinesColumn/CFD/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    walls
    {
       // type            zeroGradient;
       type        fixedFluxPressure; 
    }

    inlet
    {
        //type            zeroGradient;
        type        fixedFluxExtrapolatedPressure;
       //type        fixedFluxPressure;
     //   value       uniform 1.03e5;
    }

    outlet
    {
        type            uniformFixedValue;
        uniformValue    constant 1e5;
    }
}

// ************************************************************************* //
