tutorials/cfdemSolverRhoPimple/FinesColumn/CFD/0/alphaDyn
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphaDyn;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.01;
   /*     type groovyBC;
        uDyn uDyn;
        variables "gF=0.03;rhoF=1396;";
        valueExpression "gF/(rhoF*mag(uDyn)+0.01)";
        fractionExpression "1";
        value           uniform 0.0;
*/
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
