tutorials/cfdemSolverRhoPimple/FinesColumn/CFD/0/turb/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.000765;

boundaryField
{
    top
    {
        type            epsilonWallFunction;
        value           uniform 0.000765;
    }
    bottom
    {
        type            epsilonWallFunction;
        value           uniform 0.000765;
    }
    side
    {
        type            epsilonWallFunction;
        value           uniform 0.000765;
    }
    inlet
    {
        type            empty;
    }
    outlet_up
    {
        type		zeroGradient;
    }
    outlet_down
    {
        type		zeroGradient;
    }
}


// ************************************************************************* //
