tutorials/cfdemSolverRhoPimple/FinesColumn/CFD/0/turb/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0;//0325;

boundaryField
{
    top
    {
        type            kqRWallFunction;
        value           uniform 0.00325;
    }
    bottom
    {
        type            kqRWallFunction;
        value           uniform 0.00325;
    }
    side
    {
        type            kqRWallFunction;
        value           uniform 0.00325;
    }
    inlet
    {
        type            empty;
    }
    outlet_up
    {
        type		zeroGradient;
    }
    outlet_down
    {
        type		zeroGradient;
    }
}


// ************************************************************************* //
