tutorials/cfdemSolverRhoPimple/FinesColumn/CFD/0/turb/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    side
    {
        type            zeroGradient;
    }
    inlet
    {
        type            empty;
    }
    outlet_up
    {
        type		zeroGradient;
    }
    outlet_down
    {
        type		zeroGradient;
    }
}

// ************************************************************************* //
