tutorials/cfdemSolverRhoPimple/FinesColumn/CFD/system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.1.x                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		2.0;
	format		ascii;
	class		dictionary;
	object		probesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



fields
(
    alphaSt
    alphaDyn
    p
    U
    uDyn
);

writeControl   timeStep;
writeInterval  10;


// Locations to be probed.
probeLocations
(
	(0.0 0.0 0.130)
	(0.0 0.0 0.250)
	(0.0 0.0 0.370)
        (0.0 0.0 0.490)
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
